bdring/Grbl_Esp32/Grbl_Esp32/src/WebUI/WebServer.cpp
    //Root of Webserver/////////////////////////////////////////////////////

    void Web_Server::handle_root() {
        String path       = "/index.html";
        String pathWithGz = path + ".gz";
        //if have a index.html or gzip version this is default root page
        if ((SPIFFS.exists(pathWithGz) || SPIFFS.exists(path)) && !_webserver->hasArg("forcefallback") &&
            _webserver->arg("forcefallback") != "yes") {
            if (SPIFFS.exists(pathWithGz)) {
                path = pathWithGz;
            }

            File file = SPIFFS.open(path, FILE_READ);
            _webserver->streamFile(file, getContentType(path));
            file.close();
            return;
        }

        //if no lets launch the default content
        _webserver->sendHeader("Content-Encoding", "gzip");
        _webserver->send_P(200, "text/html", PAGE_NOFILES, PAGE_NOFILES_SIZE);
    }

    // Returns true if this handler claimed the path
    bool Web_Server::handleSD(String path) {
        if ((path.substring(0, 4) != "/SD/")) {
            return false;
        }
#    ifndef ENABLE_SD_CARD
        _webserver->send(500, "text/plain", "SD is not supported.");
        return true;
#    else
        path = path.substring(3);

        String pathWithGz = path + ".gz";
        if (SDState::Idle != get_sd_state(true)) {
            String content = "cannot open: ";
            content += path + ", SD is not available.";

            _webserver->send(500, "text/plain", content);
            return true;
        }
        if (SD.exists(pathWithGz) || SD.exists(path)) {
            set_sd_state(SDState::BusyUploading);
            if (SD.exists(pathWithGz)) {
                path = pathWithGz;
            }
            File datafile = SD.open(path);
            if (datafile) {
                vTaskDelay(1 / portTICK_RATE_MS);
                size_t totalFileSize = datafile.size();
                size_t i             = 0;
                bool   done          = false;
                _webserver->setContentLength(totalFileSize);
                _webserver->send(200, getContentType(path), "");
                uint8_t buf[1024];
                while (!done) {
                    vTaskDelay(1 / portTICK_RATE_MS);
                    int v = datafile.read(buf, 1024);
                    if ((v == -1) || (v == 0)) {
                        done = true;
                    } else {
                        _webserver->client().write(buf, 1024);
                        i += v;
                    }

                    if (i >= totalFileSize) {
                        done = true;
                    }
                }
                datafile.close();
                if (i != totalFileSize) {
                    //error: TBD
                }
                set_sd_state(SDState::Idle);
                return true;
            }
            set_sd_state(SDState::Idle);
        }
        String content = "cannot find ";
        content += path;
        _webserver->send(404, "text/plain", content);
        return true;
#    endif
    }

    void Web_Server::sendEmbeddedPage(String page) {
        String IPAddress = (WiFi.getMode() == WIFI_STA) ? WiFi.localIP().toString() : WiFi.softAPIP().toString();
        //Web address = ip + port
        if (_port != 80) {
            IPAddress += ":" + String(_port);
        }
        page.replace("$WEB_ADDRESS$", IPAddress);
        page.replace("$QUERY$", _webserver->uri());
        _webserver->send(200, "text/html", page);
    }

    // Returns true if this handler claimed the path
    bool Web_Server::handleCaptivePortal() {
#    ifndef ENABLE_CAPTIVE_PORTAL
        return false;
#    else
        if (WiFi.getMode() == WIFI_AP) {
            sendEmbeddedPage(PAGE_CAPTIVE);
            //_webserver->sendContent_P(NOT_AUTH_NF);
            //_webserver->client().stop();
            return true;
        }
        return false;
#    endif
    }

    // Returns true if this handler claimed the path
    bool Web_Server::handleLocalFS(String path) {
        String pathWithGz = path + ".gz";
        if (SPIFFS.exists(pathWithGz) || SPIFFS.exists(path)) {
            if (SPIFFS.exists(pathWithGz)) {
                path = pathWithGz;
            }
            File file = SPIFFS.open(path, FILE_READ);
            _webserver->streamFile(file, getContentType(path));
            file.close();
            return true;
        }
        return false;
    }

    // Handle not registered path
    void Web_Server::handle_not_found() {
        if (is_authenticated() == AuthenticationLevel::LEVEL_GUEST) {
            _webserver->sendContent_P("HTTP/1.1 301 OK\r\nLocation: /\r\nCache-Control: no-cache\r\n\r\n");
            //_webserver->client().stop();
            return;
        }

        String path = _webserver->urlDecode(_webserver->uri());

        if (handleSD(path)) {
            return;
        }

        if (handleLocalFS(path)) {
            return;
        }

        if (handleCaptivePortal()) {
            return;
        }

        if (handleLocalFS("/404.htm")) {
            return;
        }

        // if none of the above handlers succeeded, use the default page
        sendEmbeddedPage(PAGE_404);
    }

#    ifdef ENABLE_SSDP
    //http SSDP xml presentation
    void Web_Server::handle_SSDP() {
        StreamString sschema;
        if (sschema.reserve(1024)) {
            String templ = "<?xml version=\"1.0\"?>"
                           "<root xmlns=\"urn:schemas-upnp-org:device-1-0\">"
                           "<specVersion>"
                           "<major>1</major>"
                           "<minor>0</minor>"
                           "</specVersion>"
                           "<URLBase>http://%s:%u/</URLBase>"
                           "<device>"
                           "<deviceType>upnp:rootdevice</deviceType>"
                           "<friendlyName>%s</friendlyName>"
                           "<presentationURL>/</presentationURL>"
                           "<serialNumber>%s</serialNumber>"
                           "<modelName>ESP32</modelName>"
                           "<modelNumber>Marlin</modelNumber>"
                           "<modelURL>http://espressif.com/en/products/hardware/esp-wroom-32/overview</modelURL>"
                           "<manufacturer>Espressif Systems</manufacturer>"
                           "<manufacturerURL>http://espressif.com</manufacturerURL>"
                           "<UDN>uuid:%s</UDN>"
                           "</device>"
                           "</root>\r\n"
                           "\r\n";
            char     uuid[37];
            String   sip    = WiFi.localIP().toString();
            uint32_t chipId = (uint16_t)(ESP.getEfuseMac() >> 32);
            sprintf(uuid,
                    "38323636-4558-4dda-9188-cda0e6%02x%02x%02x",
                    (uint16_t)((chipId >> 16) & 0xff),
                    (uint16_t)((chipId >> 8) & 0xff),
                    (uint16_t)chipId & 0xff);
            String serialNumber = String(chipId);
            sschema.printf(templ.c_str(), sip.c_str(), _port, wifi_config.Hostname().c_str(), serialNumber.c_str(), uuid);
            _webserver->send(200, "text/xml", (String)sschema);
        } else {
            _webserver->send(500);
        }
    }
#    endif

